; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph4 - mode
	thermograph2 - mode
	spectrograph0 - mode
	infrared1 - mode
	infrared3 - mode
	Star1 - direction
	Star2 - direction
	Star4 - direction
	Star0 - direction
	Star3 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph4)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Planet5 infrared3)
	(have_image Phenomenon6 infrared3)
	(have_image Star7 infrared3)
	(have_image Star8 thermograph4)
	(have_image Star9 thermograph4)
	(have_image Planet10 spectrograph0)
	(have_image Planet11 infrared3)
	(have_image Planet12 infrared3)
	(have_image Star13 infrared1)
	(have_image Planet14 thermograph2)
	(have_image Star15 infrared3)
	(have_image Planet16 infrared3)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 13
2. (calibrate satellite0 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 13
3. (turn_to satellite0 star9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star9)
   goals met: 0 of 13
4. (take_image satellite0 star9 instrument2 thermograph4)
   added: (have_image star9 thermograph4)
   goals met: 1 of 13
5. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 1 of 13
6. (take_image satellite0 star8 instrument2 thermograph4)
   added: (have_image star8 thermograph4)
   goals met: 2 of 13
7. (turn_to satellite0 star13 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star13)
   goals met: 2 of 13
8. (take_image satellite0 star13 instrument2 infrared1)
   added: (have_image star13 infrared1)
   goals met: 3 of 13
9. (turn_to satellite0 star0 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star0)
   goals met: 3 of 13
10. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 3 of 13
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 13
12. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 3 of 13
13. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 13
14. (take_image satellite0 phenomenon6 instrument0 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 4 of 13
15. (turn_to satellite0 planet10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet10)
   goals met: 4 of 13
16. (take_image satellite0 planet10 instrument0 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 5 of 13
17. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 13
18. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 13
19. (turn_to satellite0 star0 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star0)
   goals met: 5 of 13
20. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 5 of 13
21. (turn_to satellite0 planet11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet11)
   goals met: 5 of 13
22. (take_image satellite0 planet11 instrument1 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 6 of 13
23. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 6 of 13
24. (take_image satellite0 planet12 instrument1 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 7 of 13
25. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 7 of 13
26. (take_image satellite0 planet14 instrument1 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 8 of 13
27. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 8 of 13
28. (take_image satellite0 planet16 instrument1 infrared3)
   added: (have_image planet16 infrared3)
   goals met: 9 of 13
29. (turn_to satellite0 planet5 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet5)
   goals met: 9 of 13
30. (take_image satellite0 planet5 instrument1 infrared3)
   added: (have_image planet5 infrared3)
   goals met: 10 of 13
31. (turn_to satellite0 star15 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star15)
   goals met: 10 of 13
32. (take_image satellite0 star15 instrument1 infrared3)
   added: (have_image star15 infrared3)
   goals met: 11 of 13
33. (turn_to satellite0 star7 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star7)
   goals met: 11 of 13
34. (take_image satellite0 star7 instrument1 infrared3)
   added: (have_image star7 infrared3)
   goals met: 12 of 13
35. (turn_to satellite0 star4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star4)
   goals met: 13 of 13
